In [1]:
import pandas as pd
import sqlite3

## Создаю соединение с файлом БД

In [2]:
con = sqlite3.connect('.\content\indicators_db.sqlite3')

Создаю функциональную обертку для удобства запросов в БД

In [3]:
def read_sql(sql_query, connection=con):
    return pd.read_sql(sql= sql_query, con=connection)

В переменную буду передавать запросы

In [4]:
sql_q = 'select * from main.org_indicators_2020_2022'

In [5]:
df= read_sql(sql_q)
df.head()

      ID  YEAR    INDICATOR_NAME     VALUE
0  20988  2020           Выручка  29337447
1  20988  2020  Оценка на Яндекс         2
2  20988  2020            Налоги    720554
3  20988  2020    Оценка на 2GIS         3
4  24828  2020           Выручка  36633885

## Загрузка дополнительных таблиц

In [6]:
df_main = pd.read_csv('./content/main.csv')
df_net_property = pd.read_csv('./content/net_property.csv')
df_seats_property = pd.read_csv('./content/seats_property.csv')
df_type_property = pd.read_csv('./content/type_property.csv')
# Актуализирую таблицу с посадочными местами
df_seats_property = df_seats_property.sort_values(by=['ID', 'ver_ID'], ascending=[True, False]) \
    .drop_duplicates('ID', keep='first')

Задание 1. Для каждой организации из main.csv подтяните выручку и число сотрудников за 2020, 2021 и 2022.

In [14]:
# sql_q = '''select ID, YEAR, INDICATOR_NAME, SUM(VALUE) as VALUE
# from main.org_indicators_2020_2022
# where INDICATOR_NAME in ('Выручка', 'Число сотрудников')
# group by ID, YEAR, INDICATOR_NAME;'''
sql_q = '''select *
from main.org_indicators_2020_2022
where INDICATOR_NAME in ('Выручка', 'Число сотрудников');'''
df = read_sql(sql_q)
df.head(20)

        ID  YEAR     INDICATOR_NAME     VALUE
0    20988  2020            Выручка  29337447
1    24828  2020            Выручка  36633885
2   358126  2020  Число сотрудников        19
3   373052  2020  Число сотрудников        16
4   373052  2020            Выручка  36385240
5   303239  2020  Число сотрудников        13
6   303239  2020            Выручка  25968809
7   351220  2020            Выручка  33571779
8   351220  2020  Число сотрудников         6
9   342854  2020            Выручка  36813374
10  363640  2020            Выручка  35651299
11  211210  2020  Число сотрудников         9
12  353273  2020            Выручка  28771191
13  353273  2020  Число сотрудников         6
14   72656  2020            Выручка  27867322
15  254675  2020            Выручка  21737701
16  151822  2020  Число сотрудников        16
17  151822  2020            Выручка  31563787
18  223862  2020  Число сотрудников         7
19  223862  2020            Выручка  30152526

In [172]:
t = df.groupby(['ID', 'YEAR', 'INDICATOR_NAME'], as_index=False)['VALUE'].sum()
t.head()

      ID  YEAR     INDICATOR_NAME     VALUE
0  19630  2020            Выручка  31222228
1  19630  2021            Выручка  21721921
2  19630  2021  Число сотрудников        15
3  19630  2022  Число сотрудников         9
4  19643  2020            Выручка  35670701

In [207]:
t1 = t.pivot_table(index='ID', columns=['INDICATOR_NAME', 'YEAR'], values='VALUE')
t1.head()

INDICATOR_NAME     Выручка                         Число сотрудников        \
YEAR                  2020        2021        2022              2020  2021
ID
19630           31222228.0  21721921.0         NaN               NaN  15.0
19643           35670701.0  39125612.0         NaN              17.0   NaN
19647           34926614.0  23176004.0  27925131.0              16.0  15.0
19657           23410468.0  28065717.0  36074059.0               NaN   8.0
19677                  NaN  30803884.0  25303592.0              17.0   9.0

INDICATOR_NAME
YEAR            2022
ID
19630            9.0
19643            NaN
19647            NaN
19657           12.0
19677            NaN

In [208]:
t1.columns = [x+' '+str(y) for x, y in t1.columns]
t1.head()

,Выручка 2020,Выручка 2021,Выручка 2022,Число сотрудников 2020,Число сотрудников 2021,Число сотрудников 2022
ID,,,,,,
19630,31222228.0,21721921.0,NaN,NaN,15.0,9.0
19643,35670701.0,39125612.0,NaN,17.0,NaN,NaN
19647,34926614.0,23176004.0,27925131.0,16.0,15.0,NaN
19657,23410468.0,28065717.0,36074059.0,NaN,8.0,12.0
19677,NaN,30803884.0,25303592.0,17.0,9.0,NaN

In [210]:
df1 = df_main.merge(t1, on='ID')
df1.head()

,ID,Name,Address,Выручка 2020,Выручка 2021,Выручка 2022,Число сотрудников 2020,Число сотрудников 2021,Число сотрудников 2022
0,20988,ГУЗ,"город Москва, улица Казакова, дом 15",29337447.0,24299167.0,31395846.0,NaN,NaN,15.0
1,24828,Кафе Халяль,"город Москва, 8-я улица Текстильщиков, дом 5, ...",36633885.0,31262894.0,33854306.0,NaN,10.0,NaN
2,358126,Scarface,"Российская Федерация, город Москва, внутригоро...",NaN,20278817.0,26250473.0,19.0,16.0,6.0
3,373052,Кулинариум,"Российская Федерация, город Москва, внутригоро...",36385240.0,26416139.0,39003318.0,16.0,6.0,NaN
4,303239,One price coffee,"Российская Федерация, город Москва, внутригоро...",25968809.0,30183522.0,NaN,13.0,17.0,18.0

In [213]:
df1['Дельта по выручке'] = df1['Выручка 2022'] - df1['Выручка 2020']

In [214]:
df1['Дельта по сотрудникам'] = df1['Число сотрудников 2022'] - df1['Число сотрудников 2020']

Index(['ID', 'Name', 'Address', 'Выручка 2020', 'Выручка 2021', 'Выручка 2022',
       'Число сотрудников 2020', 'Число сотрудников 2021',
       'Число сотрудников 2022', 'Дельта по выручке', 'Дельта по сотрудникам'],
      dtype='object')

In [220]:
df1 = df1.rename(columns={'ID': 'Идентификатор', 'Name': 'Наименование', 'Address': 'Адрес'})
df1 = df1[['Идентификатор', 'Наименование', 'Адрес', 'Выручка 2020',
       'Выручка 2021', 'Выручка 2022', 'Дельта по выручке', 'Число сотрудников 2020',
       'Число сотрудников 2021', 'Число сотрудников 2022',
       'Дельта по сотрудникам']]
df1.head()

,Идентификатор,Наименование,Адрес,Выручка 2020,Выручка 2021,Выручка 2022,Дельта по выручке,Число сотрудников 2020,Число сотрудников 2021,Число сотрудников 2022,Дельта по сотрудникам
0,20988,ГУЗ,"город Москва, улица Казакова, дом 15",29337447.0,24299167.0,31395846.0,2058399.0,NaN,NaN,15.0,NaN
1,24828,Кафе Халяль,"город Москва, 8-я улица Текстильщиков, дом 5, ...",36633885.0,31262894.0,33854306.0,-2779579.0,NaN,10.0,NaN,NaN
2,358126,Scarface,"Российская Федерация, город Москва, внутригоро...",NaN,20278817.0,26250473.0,NaN,19.0,16.0,6.0,-13.0
3,373052,Кулинариум,"Российская Федерация, город Москва, внутригоро...",36385240.0,26416139.0,39003318.0,2618078.0,16.0,6.0,NaN,NaN
4,303239,One price coffee,"Российская Федерация, город Москва, внутригоро...",25968809.0,30183522.0,NaN,NaN,13.0,17.0,18.0,5.0

In [223]:
df1 = df1.sort_values(by=['Дельта по выручке', 'Идентификатор'], ascending=[False, True])
df1.head()

,Идентификатор,Наименование,Адрес,Выручка 2020,Выручка 2021,Выручка 2022,Дельта по выручке,Число сотрудников 2020,Число сотрудников 2021,Число сотрудников 2022,Дельта по сотрудникам
9205,342920,СИДРОВ ПРОЛИВ (пивной бар),"город Москва, проспект Вернадского, дом 86В",20302399.0,NaN,39959846.0,19657447.0,6.0,11.0,14.0,8.0
152,353466,ВАНИЛЬНЫЙ ШПАТЕЛЬ мороженое,"город Москва, проспект Вернадского, дом 86В",20069455.0,38619799.0,39575437.0,19505982.0,NaN,14.0,NaN,NaN
9596,374427,Море лосося,"город Москва, улица Адмирала Макарова, дом 6, ...",20000135.0,NaN,39484937.0,19484802.0,7.0,NaN,19.0,12.0
2194,296321,Рыбалюбовь,"улица Ленинская Слобода, дом 26, помещение 102Н/5",20377254.0,21392412.0,39849066.0,19471812.0,NaN,NaN,13.0,NaN
8778,278158,Шаурмама,"Российская Федерация, город Москва, внутригоро...",20440312.0,35770505.0,39769836.0,19329524.0,18.0,NaN,NaN,NaN

In [225]:
df_result = df1.dropna(subset=['Выручка 2020', 'Выручка 2022', 'Число сотрудников 2020', 'Число сотрудников 2022'])
df_result.head()

,Идентификатор,Наименование,Адрес,Выручка 2020,Выручка 2021,Выручка 2022,Дельта по выручке,Число сотрудников 2020,Число сотрудников 2021,Число сотрудников 2022,Дельта по сотрудникам
9205,342920,СИДРОВ ПРОЛИВ (пивной бар),"город Москва, проспект Вернадского, дом 86В",20302399.0,NaN,39959846.0,19657447.0,6.0,11.0,14.0,8.0
9596,374427,Море лосося,"город Москва, улица Адмирала Макарова, дом 6, ...",20000135.0,NaN,39484937.0,19484802.0,7.0,NaN,19.0,12.0
5890,360584,"Выпечка, шаурма","Российская Федерация, город Москва, внутригоро...",20114682.0,23403344.0,39418028.0,19303346.0,13.0,NaN,11.0,-2.0
8745,344731,Кофе с собой,"Российская Федерация, город Москва, внутригоро...",21020009.0,39682516.0,39851594.0,18831585.0,8.0,NaN,10.0,2.0
4904,373914,Кафе,"город Москва, улица Айвазовского, владение 7, ...",20663231.0,31079091.0,38834892.0,18171661.0,7.0,16.0,14.0,7.0

In [226]:
df_result.to_csv('ex_6_1.csv', index=False)